Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_timer.c
    return 0;
}

static void stm32l552_timer_write(void *opaque, hwaddr offset,
                        uint64_t val64, unsigned size)
{
    STM32L552TimerState *s = opaque;
    uint32_t value = val64;
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    uint32_t timer_val = 0;

    DB_PRINT("Write 0x%x, 0x%"HWADDR_PRIx"\n", value, offset);

    switch (offset) {
    case TIM_CR1:
        s->tim_cr1 = value;
        return;
    case TIM_CR2:
        s->tim_cr2 = value;
        return;
    case TIM_SMCR:
        s->tim_smcr = value;
        return;
    case TIM_DIER:
        s->tim_dier = value;
        return;
    case TIM_SR:
        /* This is set by hardware and cleared by software */
        s->tim_sr &= value;
        return;
    case TIM_EGR:
        s->tim_egr = value;
        if (s->tim_egr & TIM_EGR_UG) {
            timer_val = 0;
            break;
        }
        return;
    case TIM_CCMR1:
        s->tim_ccmr1 = value;
        return;
    case TIM_CCMR2:
        s->tim_ccmr2 = value;
        return;
    case TIM_CCER:
        s->tim_ccer = value;
        return;
    case TIM_PSC:
        timer_val = stm32l552_ns_to_ticks(s, now) - s->tick_offset;
        s->tim_psc = value & 0xFFFF;
        break;
    case TIM_CNT:
        timer_val = value;
        break;
    case TIM_ARR:
        s->tim_arr = value;
        stm32l552_timer_set_alarm(s, now);
        return;
    case TIM_CCR1:
        s->tim_ccr1 = value;
        return;
    case TIM_CCR2:
        s->tim_ccr2 = value;
        return;
    case TIM_CCR3:
        s->tim_ccr3 = value;
        return;
    case TIM_CCR4:
        s->tim_ccr4 = value;
        return;
    case TIM_DCR:
        s->tim_dcr = value;
        return;
    case TIM_DMAR:
        s->tim_dmar = value;
        return;
    case TIM_OR:
        s->tim_or = value;
        return;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%"HWADDR_PRIx"\n", __func__, offset);
        return;
    }

    /* This means that a register write has affected the timer in a way that
     * requires a refresh of both tick_offset and the alarm.
     */
    s->tick_offset = stm32l552_ns_to_ticks(s, now) - timer_val;
    stm32l552_timer_set_alarm(s, now);
}

static const MemoryRegionOps stm32l552_timer_ops = {
    .read = stm32l552_timer_read,
    .write = stm32l552_timer_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static const VMStateDescription vmstate_stm32l552_timer = {
    .name = TYPE_STM32L552_TIMER,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_INT64(tick_offset, STM32L552TimerState),
        VMSTATE_UINT32(tim_cr1, STM32L552TimerState),
        VMSTATE_UINT32(tim_cr2, STM32L552TimerState),
        VMSTATE_UINT32(tim_smcr, STM32L552TimerState),
        VMSTATE_UINT32(tim_dier, STM32L552TimerState),
        VMSTATE_UINT32(tim_sr, STM32L552TimerState),
        VMSTATE_UINT32(tim_egr, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccmr1, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccmr2, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccer, STM32L552TimerState),
        VMSTATE_UINT32(tim_psc, STM32L552TimerState),
        VMSTATE_UINT32(tim_arr, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccr1, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccr2, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccr3, STM32L552TimerState),
        VMSTATE_UINT32(tim_ccr4, STM32L552TimerState),
        VMSTATE_UINT32(tim_dcr, STM32L552TimerState),
        VMSTATE_UINT32(tim_dmar, STM32L552TimerState),
        VMSTATE_UINT32(tim_or, STM32L552TimerState),
        VMSTATE_END_OF_LIST()
    }
};

static Property stm32l552_timer_properties[] = {
    DEFINE_PROP_UINT64("clock-frequency", struct STM32L552TimerState,
                       freq_hz, 1000000000),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32l552_timer_init(Object *obj)
{
    STM32L552TimerState *s = STM32L552TIMER(obj);

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->iomem, obj, &stm32l552_timer_ops, s,
                          "stm32l552_timer", 0x400);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->iomem);
}

static void stm32l552_timer_realize(DeviceState *dev, Error **errp)
{
    STM32L552TimerState *s = STM32L552TIMER(dev);
    s->timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, stm32l552_timer_interrupt, s);
}

static void stm32l552_timer_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = stm32l552_timer_reset;
    device_class_set_props(dc, stm32l552_timer_properties);
    dc->vmsd = &vmstate_stm32l552_timer;
    dc->realize = stm32l552_timer_realize;
}

static const TypeInfo stm32l552_timer_info = {
    .name          = TYPE_STM32L552_TIMER,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32L552TimerState),
    .instance_init = stm32l552_timer_init,
    .class_init    = stm32l552_timer_class_init,
};

static void stm32l552_timer_register_types(void)
{
    type_register_static(&stm32l552_timer_info);
}

type_init(stm32l552_timer_register_types)
